import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["id","Grade","Judge","NextId","Name","AMdetail","TragetNum","RewardType","RewardNum"],["","","","","","","","",""],[1,5,1,0,"富可敌国","得到144个宝箱",144,1,50],[2,4,2,0,"最强斗帝","成为斗帝,达到100级",100,2,10000],[3,4,20,0,"最强斗圣","成为斗圣，达到90级",90,2,9000],[4,4,21,0,"最强斗尊","成为斗尊，达到80级",80,2,8000],[5,4,22,0,"最强斗宗","成为斗宗，达到70级",70,2,7000],[6,3,23,0,"最强斗皇","成为斗皇，达到60级",60,2,6000],[7,3,24,0,"最强斗王","成为斗王，达到50级",50,2,5000],[8,3,25,0,"最强斗灵","成为斗灵，达到40级",40,2,4000],[9,2,26,0,"最强大斗师","成为大斗师，达到30级",30,2,3000],[10,2,27,0,"最强斗师","成为斗师，达到20级",20,2,2000],[11,1,28,0,"最强斗者","成为斗者，达到10级",10,2,1000],[12,5,29,0,"最强斗帝之帝","大陆最强，达到999级，无敌！",999,2,99999],[13,1,5,14,"杀戮师","成为杀戮之师，需要击杀10个敌人",10,3,100],[14,2,5,15,"杀戮王","成为杀戮之王，需要击杀50个敌人",50,3,500],[15,3,5,16,"杀戮皇","成为杀戮之皇，需要击杀100个敌人",100,3,1000],[16,4,5,17,"杀戮圣","成为杀戮之圣，需要击杀200个敌人",200,3,2000],[17,5,5,0,"杀戮帝","成为杀戮之帝，需要击杀999个敌人",999,3,9999],[18,1,6,19,"跳高师","成为跳高之师，需要累计跳跃高度达到50000米",50000,1,10],[19,2,6,20,"跳高王","成为跳高之王，需要累计跳跃高度达到100000米",100000,1,20],[20,3,6,21,"跳高皇","成为跳高之皇，，需要累计跳跃高度达到200000米",200000,1,30],[21,4,6,22,"跳高圣","成为跳高之圣，需要累计跳跃高度达到500000米",500000,1,40],[22,5,6,0,"跳高帝","成为跳高之帝，需要累计跳跃高度达到1000000米",1000000,1,50],[23,1,8,24,"倒霉师","成为倒霉之师，需要被电击或被击飞或被发射10次",10,1,1],[24,2,8,25,"倒霉王","成为倒霉之王，需要被电击或被击飞或被发射50次",50,1,2],[25,3,8,26,"倒霉皇","成为倒霉之皇，需要被电击或被击飞或被发射100次",100,1,3],[26,4,8,27,"倒霉圣","成为倒霉之圣，需要被电击或被击飞或被发射500次",500,1,4],[27,5,8,0,"倒霉帝","成为倒霉之帝，需要被电击或被击飞或被发射1000次",1000,1,5],[28,1,10,29,"舞师","成为舞师，需要跳舞10次",10,1,1],[29,2,10,30,"舞王","成为舞王，需要跳舞30次",30,1,2],[30,3,10,31,"舞皇","成为舞皇，需要跳舞90次",90,1,3],[31,4,10,32,"舞圣","成为舞圣，需要跳舞200次",200,1,4],[32,5,10,0,"舞帝","成为舞帝，需要跳舞500次",500,1,5],[33,1,11,34,"坐师","成为坐师，需要坐下10次",10,1,1],[34,2,11,35,"坐王","成为坐王，需要坐下50次",50,1,2],[35,3,11,36,"坐皇","成为坐皇，需要坐下100次",100,1,3],[36,4,11,37,"坐圣","成为坐圣，需要坐下300次",300,1,4],[37,5,11,0,"坐帝","成为坐帝，需要坐下999次",999,1,5],[38,1,12,39,"武器之师","成为武器之师，需要更换10次武器",10,3,100],[39,2,12,40,"武器之王","成为武器之王，需要更换50次武器",50,3,200],[40,3,12,41,"武器之皇","成为武器之皇，需要更换150次武器",150,3,300],[41,4,12,42,"武器之圣","成为武器之圣，需要更换500次武器",500,3,400],[42,5,12,0,"武器之帝","成为武器之帝，需要更换999次武器",999,3,500],[43,1,13,44,"换装之师","成为换装之师，需要换装10次",10,1,1],[44,2,13,45,"换装之王","成为换装之王，需要换装50次",50,1,2],[45,3,13,46,"换装之皇","成为换装之皇，需要换装150次",150,1,3],[46,4,13,47,"换装之圣","成为换装之圣，需要换装500次",500,1,4],[47,5,13,0,"换装之帝","成为换装之帝，需要换装999次",999,1,5],[48,1,14,49,"飞行之师","成为飞行之师，需要更换10次飞行翅膀",10,1,1],[49,2,14,50,"飞行之王","成为飞行之王，需要更换50次飞行翅膀",50,1,2],[50,3,14,41,"飞行之皇","成为飞行之皇，需要更换150次飞行翅膀",150,1,3],[51,4,14,52,"飞行之圣","成为飞行之圣，需要更换500次飞行翅膀",500,1,4],[52,5,14,0,"飞行之帝","成为飞行之帝，需要更换999次飞行翅膀",999,1,5],[53,1,15,54,"特效之师","成为特效之师，需要更换10次拖尾特效",10,1,1],[54,2,15,55,"特效之王","成为特效之王，需要更换50次拖尾特效",50,1,2],[55,3,15,56,"特效之皇","成为特效之皇，需要更换150次拖尾特效",150,1,3],[56,4,15,57,"特效之圣","成为特效之圣，需要更换500次拖尾特效",500,1,4],[57,5,15,0,"特效之帝","成为特效之帝，需要更换999次拖尾特效",999,1,5],[58,1,16,59,"音乐之师","成为音乐之师，需要切换10次背景音乐",10,1,1],[59,2,16,60,"音乐之王","成为音乐之王，需要切换50次背景音乐",50,1,2],[60,3,16,61,"音乐之皇","成为音乐之皇，需要切换150次背景音乐",150,1,3],[61,4,16,62,"音乐之圣","成为音乐之圣，需要切换500次背景音乐",500,1,4],[62,5,16,0,"音乐之帝","成为音乐之帝，需要切换999次背景音乐",999,1,5],[63,1,17,64,"抽奖之师","成为抽奖之师，需要抽奖10次",10,1,1],[64,2,17,65,"抽奖之王","成为抽奖之王，需要抽奖50次",50,1,2],[65,3,17,66,"抽奖之皇","成为抽奖之皇，需要抽奖150次",150,1,3],[66,4,17,67,"抽奖之圣","成为抽奖之圣，需要抽奖500次",500,1,4],[67,5,17,0,"抽奖之帝","成为抽奖之帝，需要抽奖999次",999,1,5],[68,1,18,69,"寻宝之师","成为寻宝之师，需要使用藏宝图10次",10,1,1],[69,2,18,70,"寻宝之王","成为寻宝之王，需要使用藏宝图50次",50,1,2],[70,3,18,71,"寻宝之皇","成为寻宝之皇，需要使用藏宝图150次",150,1,3],[71,4,18,72,"寻宝之圣","成为寻宝之圣，需要使用藏宝图500次",500,1,4],[72,5,18,0,"寻宝之帝","成为寻宝之帝，需要使用藏宝图999次",999,1,5]];
export interface IAchievementsElement extends IElementBase{
 	/**唯一ID*/
	id:number
	/**1-容易
2-简单
3-中等
4-困难
5-疯狂*/
	Grade:number
	/**1-获取宝箱
2-达到斗帝
5-击杀人数
6-最大高度
8-击飞次数
10-跳舞次数
11-坐下次数
12-使用武器次数
13-换装次数
14-使用翅膀次数
15-使用拖尾次数
16-切换背景音乐次数
17-抽奖次数
18-使用藏宝图次数
20-斗圣
21-斗尊
22-斗宗
23-斗皇
24-斗王
25-斗灵
26-大斗师
27-斗师
28-斗者
29-斗帝999星*/
	Judge:number
	/**下一个成就ID*/
	NextId:number
	/**成就名字*/
	Name:string
	/**描述*/
	AMdetail:string
	/**目标数*/
	TragetNum:number
	/**奖励类型
等级：1
血量：2
攻击力：3*/
	RewardType:number
	/**奖励数量*/
	RewardNum:number
 } 
export class AchievementsConfig extends ConfigBase<IAchievementsElement>{
	constructor(){
		super(EXCELDATA);
	}

}