import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Describe","AssetId","SexType"],["","","",""],[1,"眼影","531761",0],[2,"眼影","370255",0],[3,"眼影","370254",0],[4,"眼影","370248",0],[5,"眼影","370247",0],[6,null,"370244",0],[7,null,"370243",0],[8,null,"367134",0],[9,null,"286896",0],[10,null,"270029",0],[11,null,"267302",0],[12,null,"267299",0],[13,null,"267298",0],[14,null,"266369",0],[15,null,"266365",0],[16,null,"266364",0],[17,null,"266347",0],[18,null,"266346",0],[19,null,"266345",0],[20,null,"266344",0],[21,null,"223838",0],[22,null,"215796",0],[23,null,"215517",0],[24,null,"215516",0],[25,null,"215515",0],[26,null,"215514",0],[27,null,"215513",0],[28,null,"215512",0],[29,null,"215511",0],[30,null,"215510",0],[31,null,"215509",0],[32,null,"215508",0],[33,null,"215507",0],[34,null,"215506",0],[35,null,"215505",0],[36,null,"215504",0],[37,null,"215503",0],[38,null,"215502",0],[39,null,"215501",0],[40,null,"215500",0],[41,null,"215499",0],[42,null,"215498",0],[43,null,"215497",0],[44,null,"215496",0],[45,null,"215495",0],[46,null,"215494",0],[47,null,"215493",0],[48,null,"215492",0],[49,null,"215491",0],[50,null,"215490",0],[51,null,"215489",0],[52,null,"215488",0],[53,null,"215358",0],[54,null,"215357",0],[55,null,"215356",0],[56,null,"215355",0],[57,null,"215354",0],[58,null,"215353",0],[59,null,"215352",0],[60,null,"215351",0],[61,null,"215350",0],[62,null,"215349",0],[63,null,"215348",0],[64,null,"215347",0],[65,null,"215346",0],[66,null,"215345",0],[67,null,"164825",0],[68,null,"116441",0],[69,null,"116390",0],[70,null,"107624",0],[71,null,"107623",0],[72,null,"77600",0],[73,null,"77599",0],[74,null,"77530",0],[75,null,"77529",0],[76,null,"77528",0],[77,null,"77497",0],[78,null,"77496",0],[79,null,"77495",0],[80,null,"77494",0],[81,null,"75951",0],[82,null,"70245",0],[83,null,"32082",0],[84,null,"32081",0]];
export interface IEyeshadowElement extends IElementBase{
 	/**undefined*/
	ID:number
	/**undefined*/
	Describe:string
	/**undefined*/
	AssetId:string
	/**0-Common
1-Male
2-FeMale*/
	SexType:number
 } 
export class EyeshadowConfig extends ConfigBase<IEyeshadowElement>{
	constructor(){
		super(EXCELDATA);
	}

}