import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Describe","AssetId","SexType"],["","","",""],[1,"风暴女","142261",2],[2,"绯红女巫","142262",2],[3,"黑寡妇","142891",2],[4,"惊奇队长","142893",2],[5,"神奇女侠","142902",2],[6,"女战士","349374",2],[7,"魔法女孩","350260",2],[8,"战士服","164416",2],[9,"作战服","164420",2],[10,"紧身作战服","164425",2],[11,"塞西亚套装","321428",2],[12,"男式紧身服","162938",1],[13,"道服","162937",1],[14,"男作战服","162946",1],[15,"雷电战士服饰","164355",1],[16,"鱼族战士服","164360",1],[17,"战士服","164361",1],[18,"法师服饰","164362",1],[19,"面具骑士服","164371",1],[20,"黑夜战士服","164373",1],[21,"黄金战甲","164378",1],[22,"蝙蝠侠","142884",1],[23,"超人","142885",1],[24,"毒液","142886",1],[25,"恶灵骑士","142887",1],[26,"钢铁侠","142888",1],[27,"海王","142889",1],[28,"黑豹","142890",1],[29,"金刚狼","142892",1],[30,"雷神","142894",1],[31,"洛基","142895",1],[32,"绿灯侠","142896",1],[33,"绿巨人","142897",1],[34,"美国队长","142898",1],[35,"灭霸","142899",1],[36,"奇异博士","142900",1],[37,"闪电侠","142901",1],[38,"死侍","142903",1],[39,"万磁王","142904",1],[40,"蚁人","142905",1],[41,"鹰眼","142906",1],[42,"蜘蛛侠","142907",1]];
export interface IHeroStylingOutfitElement extends IElementBase{
 	/**undefined*/
	ID:number
	/**undefined*/
	Describe:string
	/**undefined*/
	AssetId:string
	/**0-Common
1-Male
2-FeMale*/
	SexType:number
 } 
export class HeroStylingOutfitConfig extends ConfigBase<IHeroStylingOutfitElement>{
	constructor(){
		super(EXCELDATA);
	}

}