import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Describe","AssetId","SexType"],["","","",""],[1,"圣诞节女","136298",2],[2,"煎饼狗子","141608",2],[3,"新年双马尾女","141918",2],[4,"新年女","142187",2],[5,"雪人001","142264",2],[6,"新年女青年","142285",2],[7,"万圣节女","143399",2],[8,"圣诞服装","162933",2],[9,"汉服襦裙","163276",2],[10,"圣诞公主裙","163326",2],[11,"圣诞装","163549",2],[12,"春节时装","163552",2],[13,"雪人装","164566",2],[14,"新年装","297941",2],[15,"兔子套装","314666",2],[16,"汉服长袍","162964",1],[17,"春节时装","164565",1],[18,"摇滚歌手服饰","164567",1],[19,"圣诞老人服","164568",1],[20,"巫医服饰","164569",1],[21,"教廷服饰","164570",1],[22,"鬼脸套装","164571",1],[23,"圣诞老人套装","164572",1],[24,"圣诞装","164573",1],[25,"鸡蛋套装","314226",1],[26,"兔子套装","314664",1],[27,"圣诞老人","136299",1],[28,"Cupid","141077",1],[29,"凌羽琪","141155",1],[30,"新年男","142186",1],[31,"新年男青年","142273",1],[32,"新年男中年","142284",1],[33,"新年男005","142313",1]];
export interface IHolidayStylingOutfitElement extends IElementBase{
 	/**undefined*/
	ID:number
	/**undefined*/
	Describe:string
	/**undefined*/
	AssetId:string
	/**0-Common
1-Male
2-FeMale*/
	SexType:number
 } 
export class HolidayStylingOutfitConfig extends ConfigBase<IHolidayStylingOutfitElement>{
	constructor(){
		super(EXCELDATA);
	}

}