import { ConfigBase, IElementBase } from "./ConfigBase";
const EXCELDATA:Array<Array<any>> = [["ID","Describe","AssetId","Transform","SexType"],["","","","",""],[1,"单手刀","334208",["0","0","0","0","0","0","1","1","1"],0],[2,null,"297029",["0","0","0","0","0","0","1","1","1"],0],[3,"散弹喷枪","155702",["0","0","0","0","0","0","1","1","1"],0],[4,null,"122956",["0","0","0","0","0","0","1","1","1"],0],[5,null,"122952",["0","0","0","0","0","0","1","1","1"],0],[6,null,"31734",["0","0","0","0","0","0","1","1","1"],0],[7,null,"31728",["0","0","0","0","0","0","1","1","1"],0],[8,null,"31724",["0","0","0","0","0","0","1","1","1"],0],[9,null,"221099",["0","0","0","0","0","0","1","1","1"],0],[10,null,"122716",["0","0","0","0","0","0","1","1","1"],0],[11,null,"166941",["0","0","0","0","0","0","1","1","1"],0],[12,null,"155696",["0","0","0","0","0","0","1","1","1"],0],[13,null,"122726",["0","0","0","0","0","0","1","1","1"],0],[14,null,"168811",["0","0","0","0","0","0","1","1","1"],0],[15,null,"155702",["0","0","0","0","0","0","1","1","1"],0],[16,null,"122720",["0","0","0","0","0","0","1","1","1"],0]];
export interface IRightHandElement extends IElementBase{
 	/**undefined*/
	ID:number
	/**undefined*/
	Describe:string
	/**undefined*/
	AssetId:string
	/**undefined*/
	Transform:Array<string>
	/**0-Common
1-Male
2-FeMale*/
	SexType:number
 } 
export class RightHandConfig extends ConfigBase<IRightHandElement>{
	constructor(){
		super(EXCELDATA);
	}

}